Tekla Open API Reference for Tekla Structures 2025
Model.CommitChanges Method
Overload List
Name | Description
CommitChanges()
 Commits the changes made to the model database so far. One commit is something that a user can later on undo with the undo command. A commit also launches the drawing of the changed product model to the visible views. A dependent plug-in should never call CommitChanges, since this would make undo very difficult for the user to do. However, non-dependent plug-ins require a separate commit if new objects are created.
CommitChanges(String)
 Commits the changes made to the model database so far. One commit is something that a user can later on undo with the undo command. A commit also launches the drawing of the changed product model to the visible views. A plug-in should never call CommitChanges, since this would make undo very difficult for the user to do.
Top
See Also
Reference
Model Class
Tekla.Structures.Model Namespace